README.org
* What does this repository contain?
in this repo you will find the material used in the introductory course
held on December 2024 in Federico II univerity, Neaples (Italy)

All original material is licensed under GNU GPLv3

  - in this directory you will find 6 notebooks [[file:doc/.][doc]]
    - [[file:doc/Part_1.ipynb][Part 1:]] Introduction to Jupyter
    - [[file:doc/Part_2.ipynb][Part 2:]] Introduction to Pandas
    - [[file:doc/Part_3.ipynb][Part 3:]] Introduction to Exploratory Data Anslysis
    - [[file:doc/Part_4.ipynb][Part 4:]] Turning a Notebook into a Script
    - [[file:doc/Part_5.ipynb][Part 5:]] Introduction to Linear Regression
    - [[file:doc/Part_6.ipynb][Part 6:]] Introduction to Statistical Tests

  - file:pyproject.toml contains the dependency libraries

* Data sources used in this repository
** Temperature data in Rome and Bari 1951 - 2009
- https://www.ecad.eu/
  - [[file:doc/BARI.zip][BARI.zip]]
  - [[file:doc/ROMA.zip][ROMA.zip]]
- https://guides.library.lincoln.ac.uk/mash/datasets
** Economics
- https://www.worldbank.org/en/publication/gfdr/data/global-financial-development-database
  - [[file:doc/20220909-global-financial-development-database.xlsx][Financial Development]]
** Titanic and Languages datasets
- https://github.com/datasciencedojo/datasets.git
** Statsmodels package data
- https://www.statsmodels.org/stable/datasets
** UCLA crime dataset
- https://stats.idre.ucla.edu/wp-content/uploads/2016/02/crime.txt
** Unemployment in Italy
- https://www.istat.it
  - [[file:doc/unemployment_it.csv][Unemployment]]
** Resource consumption in Milan
- https://www.dati.gov.it/
  - [[file:doc/ds523_consumoacquaenergia.csv][Energy, Gas and Water]]
** Iris
- [[file:doc/iris.csv][Iris]]
* Blog Posts
- https://noiseonthenet.space/noise/2025/01/a-trip-to-jupyter-lab/
- https://noiseonthenet.space/noise/2025/01/meet-the-pandas/
