README.md

# Table of Contents

1.  [What does this repository contain?](#orgfc065aa)
2.  [Data sources used in this repository](#org07caeff)
    1.  [Temperature data in Rome and Bari 1951 - 2009](#org7d81dc9)
    2.  [Economics](#org2138fe5)
    3.  [Titanic and Languages datasets](#org33fb40b)
    4.  [Statsmodels package data](#org68a18d3)
    5.  [UCLA crime dataset](#org63f031f)
    6.  [Unemployment in Italy](#orgc44aac8)
    7.  [Resource consumption in Milan](#org4e8432d)
    8.  [Iris](#org768a29f)
3.  [Blog Posts](#org42e926e)


<a id="orgfc065aa"></a>

# What does this repository contain?

in this repo you will find the material used in the introductory course
held on December 2024 in Federico II univerity, Neaples (Italy)

All original material is licensed under GNU GPLv3

-   in this directory you will find 6 notebooks [doc](doc/.)
    -   [Part 1:](doc/Part_1.ipynb) Introduction to Jupyter
    -   [Part 2:](doc/Part_2.ipynb) Introduction to Pandas
    -   [Part 3:](doc/Part_3.ipynb) Introduction to Exploratory Data Anslysis
    -   [Part 4:](doc/Part_4.ipynb) Turning a Notebook into a Script
    -   [Part 5:](doc/Part_5.ipynb) Introduction to Linear Regression
    -   [Part 6:](doc/Part_6.ipynb) Introduction to Statistical Tests

-   <pyproject.toml> contains the dependency libraries


<a id="org07caeff"></a>

# Data sources used in this repository


<a id="org7d81dc9"></a>

## Temperature data in Rome and Bari 1951 - 2009

-   <https://www.ecad.eu/>
    -   [BARI.zip](doc/BARI.zip)
    -   [ROMA.zip](doc/ROMA.zip)
-   <https://guides.library.lincoln.ac.uk/mash/datasets>


<a id="org2138fe5"></a>

## Economics

-   <https://www.worldbank.org/en/publication/gfdr/data/global-financial-development-database>
    -   [Financial Development](doc/20220909-global-financial-development-database.xlsx)


<a id="org33fb40b"></a>

## Titanic and Languages datasets

-   <https://github.com/datasciencedojo/datasets.git>


<a id="org68a18d3"></a>

## Statsmodels package data

-   <https://www.statsmodels.org/stable/datasets>


<a id="org63f031f"></a>

## UCLA crime dataset

-   <https://stats.idre.ucla.edu/wp-content/uploads/2016/02/crime.txt>


<a id="orgc44aac8"></a>

## Unemployment in Italy

-   <https://www.istat.it>
    -   [Unemployment](doc/unemployment_it.csv)


<a id="org4e8432d"></a>

## Resource consumption in Milan

-   <https://www.dati.gov.it/>
    -   [Energy, Gas and Water](doc/ds523_consumoacquaenergia.csv)


<a id="org768a29f"></a>

## Iris

-   [Iris](doc/iris.csv)


<a id="org42e926e"></a>

# Blog Posts

-   <https://noiseonthenet.space/noise/2025/01/a-trip-to-jupyter-lab/>
-   <https://noiseonthenet.space/noise/2025/01/meet-the-pandas/>

